{
    "publications": [
      {
        "title": "Conceptions of Spanning Sets and Linear Independence Emerging From Examples and Student Responses to Reading Questions in an Interactive Linear Algebra Textbook",
        "pub_id": 1,
        "thumbnail": "static/publications/cerme23/cerme-thumbnail",
        "date": "July 2023",
        "authors": ["Vilma Mesa", "Eric Khiu", "Saba Gerami", "Tom Judson"],
        "venue": "The 13th Congress of the European Society for Research in Mathematics Education (CERME13), July 2023, Budapest, Hungary",
        "venue_link": "https://cerme13.renyi.hu/",
        "journal": "",
        "journal_link": "",
        "abstract": "Using Balacheff's (2013) model of conceptions we analyzed textbook examples in two sections that modeled the mathematical work needed to answer two reading questions and used the intended conceptions to identify control structures in student responses to those questions. Reading questions are an interactive textbook feature meant to entice students to read the textbook before attending the lesson when such ideas will be discussed; as students provide responses in their interactive textbook, the instructors can learn about how students are thinking about the content before a lesson. We found additional control structures, which suggest additional conceptions beyond the ones promoted in the textbook. We discuss implications for designing these types of questions in interactive textbooks.",
        "paper": "https://hal.science/hal-04417611/document",
        "poster": "",
        "slides": "",
        "presentation": "",
        "tags": ["Mathematics Education"]
      },
      {
        "title": "Conception of Span in Linear Algebra: From Textbook Responses to Student Responses",
        "pub_id": 2,
        "thumbnail": "static/publications/esm24/esm-thumbnail",
        "date": "March 2024",
        "authors": ["Saba Gerami", "Eric Khiu", "Vilma Mesa", "Tom Judson"],
        "venue": "",
        "venue_link": "",
        "journal": "Educational Studies in Mathematics",
        "journal_link": "https://link.springer.com/journal/10649",
        "abstract": "Using Balacheff's (2013) model of conceptions we analyzed textbook examples in two sections that modeled the mathematical work needed to answer two reading questions and used the intended conceptions to identify control structures in student responses to those questions. Reading questions are an interactive textbook feature meant to entice students to read the textbook before attending the lesson when such ideas will be discussed; as students provide responses in their interactive textbook, the instructors can learn about how students are thinking about the content before a lesson. We found additional control structures, which suggest additional conceptions beyond the ones promoted in the textbook. We discuss implications for designing these types of questions in interactive textbooks.",
        "paper": "https://link.springer.com/article/10.1007/s10649-024-10306-8",
        "poster": "",
        "slides": "static/publications/esm24/mathfest23-conception-slides.pdf",
        "presentation": "",
        "tags": ["Mathematics Education"]
      },
      {
        "title": "Predicting Machine Translation Performance on Low-Resource Languages: The Role of Domain Similarity",
        "pub_id": 3,
        "thumbnail": "static/publications/eacl24/perfpred-thumbnail",
        "date": "March 2024",
        "authors": ["Eric Khiu", "Hasti Toossi", "David Anugraha", "Jinyu Liu", "Jiaxu Li", "Juan Flores", "Leandro Roman", "A. Seza Doğruöz", "En-Shiun Lee"],
        "venue": "The 18th Conference of the European Chapter of the Association for Computational Linguistics (EACL 2024), March 2024, St. Julian's, Malta.",
        "venue_link": "https://2024.eacl.org/",
        "journal": "",
        "journal_link": "",
        "abstract": "Fine-tuning and testing a multilingual large language model is a challenge for low-resource languages (LRLs) since it is an expensive process. While previous studies have predicted the performance of natural language processing (NLP) tasks using machine learning methods, they primarily focus on high-resource languages, overlooking LRLs and shifts across domains. Focusing on LRLs, we investigate three factors (the size of the fine-tuning corpus, domain similarity between fine-tuning and testing corpora, and language similarity between source and target languages), which can potentially impact the model performance by using classical regression models. Our results indicate that domain similarity has the most important impact on predicting the performance of Machine Translation models.",
        "paper": "https://aclanthology.org/2024.findings-eacl.100/",
        "poster": "static/publications/eacl24/perfpred-poster.pdf",
        "slides": "static/publications/eacl24/slides.pdf",
        "presentation": "",
        "tags": ["Machine Translation", "Computational Linguistics"]
      },
      {
        "title": "A Reproducibility Study on Quantifying Language Similarity: The Impact of Missing Values in the URIEL Knowledge Base",
        "pub_id": 4,
        "thumbnail": "static/publications/naacl24/reproducibility-thumbnail",
        "date": "June 2024",
        "authors": ["Hasti Toossi", "Guo Qing Huai", "Jinyu Liu", "Eric Khiu", "A. Seza Doğruöz", "En-Shiun Annie Lee"],
        "venue": "2024 Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL) SRW, June 2024, Mexico City, Mexico",
        "venue_link": "https://2024.naacl.org/",
        "journal": "",
        "journal_link": "",
        "abstract": "In the pursuit of supporting more languages around the world, tools that characterize properties of languages play a key role in expanding the existing multilingual NLP research. In this study, we focus on a widely used typological knowledge base, URIEL, which aggregates linguistic information into numeric vectors. Specifically, we delve into the soundness and reproducibility of the approach taken by URIEL in quantifying language similarity. Our analysis reveals URIEL's ambiguity in calculating language distances and in handling missing values. Moreover, we find that URIEL does not provide any information about typological features for 31% of the languages it represents, undermining the reliabilility of the database, particularly on low-resource languages. Our literature review suggests URIEL and lang2vec are used in papers on diverse NLP tasks, which motivates us to rigorously verify the database as the effectiveness of these works depends on the reliability of the information the tool provides.",
        "paper": "https://aclanthology.org/2024.naacl-srw.25/",
        "poster": "static/publications/naacl24/reproducibility-poster.pdf",
        "slides": "",
        "presentation": "",
        "tags": ["Computational Linguistics"]
      },
      {
        "title": "URIEL+: Enhancing Linguistic Inclusion and Usability in a Typological and Multilingual Knowledge Base",
        "pub_id": 5,
        "thumbnail": "static/publications/coling25/urielp-thumbnail",
        "date": "September 2024",
        "authors": ["Aditya Khan", "Mason Shipton", "David Anugraha", "Kaiyao Duan", "Phuong H. Hoang", "Eric Khiu", "A. Seza Doğruöz", "En-Shiun Annie Lee"],
        "venue": "",
        "venue_link": "",
        "journal": "",
        "journal_link": "",
        "abstract": "URIEL is a knowledge base offering geographical, phylogenetic, and typological vector representations for 7970 languages. It includes distance measures between these vectors for 4005 languages, which are accessible via the lang2vec tool. Despite being frequently cited, URIEL is limited in terms of linguistic inclusion and overall usability. To tackle these challenges, we introduce URIEL+, an enhanced version of URIEL and lang2vec addressing these limitations. In addition to expanding typological feature coverage for 2898 languages, URIEL+ improves user experience with robust, customizable distance calculations to better suit the needs of the users. These upgrades also offer competitive performance on downstream tasks and provide distances that better align with linguistic distance studies.",
        "paper": "https://arxiv.org/abs/2409.18472",
        "poster": "",
        "slides": "",
        "presentation": "",
        "tags": ["Computational Linguistics"]
      }
    ]
  }
  